CylinderVisWD_Re1E6_Chi1000_FineMesh/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

//speed of sound at sea level 340.29
//mach number M=U/a

//air properties at sea level
//p 101325
//rho 1.225
//T 288 K
//mu 0.00001789
//gamma 1.4
//R_air 287.057

internalField   uniform 1;

boundaryField
{

    in
    {
/*
        type            fixedValue;
        value           uniform 288;
*/

        //type            inletOutlet;
        //inletValue      uniform 1;
        //value           uniform 1;
        type		freestream;
        freestreamValue uniform 1;
    }

    out
    {
        //type            zeroGradient;

        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }

    sym1
    {
        type            symmetry;

        //type            inletOutlet;
        //inletValue      uniform 1;
        //value           uniform 1;
    }

    sym2
    {
        type            symmetry;

        //type            inletOutlet;
        //inletValue      uniform 1;
        //value           uniform 1;
    }

    cylinder
    {
        type            zeroGradient;
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }
    
}

// ************************************************************************* //
