CylinderVisWD_Re1E6_Chi1000_FineMesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1183 0 0);

boundaryField
{
    in
    {
	//type            inletOutlet;
        //inletValue      uniform (0.1183 0 0);
	type		freestreamVelocity;
	freestreamValue	uniform (0.1183 0 0);

    }

    out
    {
        type            inletOutlet;
        inletValue      uniform (0.1183 0 0);
        value           uniform (0.1183 0 0);
    }

    sym1
    {
        type            symmetry;
        //type            inletOutlet;
        //inletValue      uniform (0.1183 0 0);
        //value           uniform (0.1183 0 0);

    }

    sym2
    {
        type            symmetry;
        //type            inletOutlet;
        //inletValue      uniform (0.1183 0 0);
        //value           uniform (0.1183 0 0);

    }

    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);

    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }
}

// ************************************************************************* //
