CylinderVisWD_Re1E6_Chi1000_FineMesh/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    in
    {
        type            calculated;
        value           uniform 0;
    }
    out
    {
        type            calculated;
        value           uniform 0;
    }

    sym1
    {
        type            symmetry; //zeroGradient;
    }

    sym2
    {
        type            symmetry; //zeroGradient;
    }

    cylinder
    {
        type            nutUSpaldingWallFunction; 
        value           uniform 1e-10;
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }

}

// ************************************************************************* //
