CylinderVisWD_Re1E6_Chi1000_FineMesh/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    in
    {
        //type            zeroGradient;
	//type            inletOutlet;
        //inletValue      uniform 1;
        //value           uniform 1;
	type		freestreamPressure;
	freestreamValue uniform 1;
    }

    out
    {
        type            waveTransmissive;
        phi             phi;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        1;
        field           p;
        value           uniform 1;
        lInf            2;
    }

    sym1
    {
	type		symmetry;
	//type            waveTransmissive;
        //phi             phi;
        //rho             rho;
        //psi             thermo:psi;
        //gamma           1.4;
        //fieldInf        1;
        //field           p;
        //value           uniform 1;
        //lInf            2;
    }

    sym2
    {
        type            symmetry;
	//type            waveTransmissive;
        //phi             phi;
        //rho             rho;
        //psi             thermo:psi;
        //gamma           1.4;
        //fieldInf        1;
        //field           p;
        //value           uniform 1;
        //lInf            2;
    }

    cylinder
    {
        type            zeroGradient;
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }
}

// ************************************************************************* //
