CylinderVisWD_Re1E6_Chi1000_FineMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    out
    {
        type            patch;
        nFaces          160;
        startFace       73160;
    }
    sym1
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          200;
        startFace       73320;
    }
    sym2
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          200;
        startFace       73520;
    }
    in
    {
        type            patch;
        nFaces          160;
        startFace       73720;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       73880;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          36800;
        startFace       74040;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          36800;
        startFace       110840;
    }
)

// ************************************************************************* //
