CylinderVisWD_Re1E6_Chi1000_FineMesh/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (680 0 0)
);

regions
(
    boxToCell
    {
        box (0 -100 -100) (100 100 100);
        fieldValues
        (
            volVectorFieldValue U (670 118 0)
        );
    }
);

// ************************************************************************* //
